DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/usb_dwc3/usb_dwc3_regs.h
/*
 * Copyright (c) 2015-2021, STMicroelectronics - All Rights Reserved
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef __USB_DWC3_REGS_H
#define __USB_DWC3_REGS_H

/*
 * USB3 Global Register Block
 */
#define _DWC3_GSBUSCFG0					U(0x0)
#define _DWC3_GSBUSCFG1					U(0x4)
#define _DWC3_GTXTHRCFG					U(0x8)
#define _DWC3_GRXTHRCFG					U(0xC)
#define _DWC3_GCTL					U(0x10)
#define _DWC3_GPMSTS					U(0x14)
#define _DWC3_GSTS					U(0x18)
#define _DWC3_GUCTL1					U(0x1C)
#define _DWC3_GSNPSID					U(0x20)
#define _DWC3_GGPIO					U(0x24)
#define _DWC3_GUID					U(0x28)
#define _DWC3_GUCTL					U(0x2C)
#define _DWC3_GBUSERRADDRLO				U(0x30)
#define _DWC3_GBUSERRADDRHI				U(0x34)
#define _DWC3_GPRTBIMAPLO				U(0x38)
#define _DWC3_GPRTBIMAPHI				U(0x3C)
#define _DWC3_GHWPARAMS0				U(0x40)
#define _DWC3_GHWPARAMS1				U(0x44)
#define _DWC3_GHWPARAMS2				U(0x48)
#define _DWC3_GHWPARAMS3				U(0x4C)
#define _DWC3_GHWPARAMS4				U(0x50)
#define _DWC3_GHWPARAMS5				U(0x54)
#define _DWC3_GHWPARAMS6				U(0x58)
#define _DWC3_GHWPARAMS7				U(0x5C)
#define _DWC3_GDBGFIFOSPACE				U(0x60)
#define _DWC3_GDBGLTSSM					U(0x64)
#define _DWC3_GDBGLNMCC					U(0x68)
#define _DWC3_GDBGBMU					U(0x6C)
#define _DWC3_GDBGLSPMUX_HST				U(0x70)
#define _DWC3_GDBGLSP					U(0x74)
#define _DWC3_GDBGEPINFO0				U(0x78)
#define _DWC3_GDBGEPINFO1				U(0x7C)
#define _DWC3_GPRTBIMAP_HSLO				U(0x80)
#define _DWC3_GPRTBIMAP_HSHI				U(0x84)
#define _DWC3_GPRTBIMAP_FSLO				U(0x88)
#define _DWC3_GPRTBIMAP_FSHI				U(0x8C)
#define _DWC3_GUCTL2					U(0x9C)
#define _DWC3_GUSB2PHYCFG				U(0x100)
#define _DWC3_GUSB2I2CCTL				U(0x140)
#define _DWC3_GUSB2PHYACC_ULPI				U(0x180)
#define _DWC3_GUSB3PIPECTL				U(0x1c0)
#define _DWC3_GTXFIFOSIZ0				U(0x200)
#define _DWC3_GTXFIFOSIZ1				U(0x204)
#define _DWC3_GTXFIFOSIZ2				U(0x208)
#define _DWC3_GTXFIFOSIZ3				U(0x20c)
#define _DWC3_GTXFIFOSIZ4				U(0x210)
#define _DWC3_GTXFIFOSIZ5				U(0x214)
#define _DWC3_GTXFIFOSIZ6				U(0x218)
#define _DWC3_GTXFIFOSIZ7				U(0x21c)
#define _DWC3_GTXFIFOSIZ8				U(0x220)
#define _DWC3_GTXFIFOSIZ9				U(0x224)
#define _DWC3_GTXFIFOSIZ10				U(0x228)
#define _DWC3_GTXFIFOSIZ11				U(0x22c)
#define _DWC3_GRXFIFOSIZ0				U(0x280)
#define _DWC3_GRXFIFOSIZ1				U(0x284)
#define _DWC3_GRXFIFOSIZ2				U(0x288)
#define _DWC3_GEVNTADRLO				U(0x300)
#define _DWC3_GEVNTADRHI				U(0x304)
#define _DWC3_GEVNTSIZ					U(0x308)
#define _DWC3_GEVNTCOUNT				U(0x30c)
#define _DWC3_GHWPARAMS8				U(0x500)
#define _DWC3_GTXFIFOPRIDEV				U(0x510)
#define _DWC3_GTXFIFOPRIHST				U(0x518)
#define _DWC3_GRXFIFOPRIHST				U(0x51C)
#define _DWC3_GDMAHLRATIO				U(0x524)
#define _DWC3_GFLADJ					U(0x530)

/* _DWC3_GSBUSCFG0 register fields */
#define _DWC3_GSBUSCFG0_INCRBRSTENA			BIT_32(0)
#define _DWC3_GSBUSCFG0_INCR4BRSTENA			BIT_32(1)
#define _DWC3_GSBUSCFG0_INCR8BRSTENA			BIT_32(2)
#define _DWC3_GSBUSCFG0_INCR16BRSTENA			BIT_32(3)
#define _DWC3_GSBUSCFG0_INCR32BRSTENA			BIT_32(4)
#define _DWC3_GSBUSCFG0_INCR64BRSTENA			BIT_32(5)
#define _DWC3_GSBUSCFG0_INCR128BRSTENA			BIT_32(6)
#define _DWC3_GSBUSCFG0_INCR256BRSTENA			BIT_32(7)
#define _DWC3_GSBUSCFG0_DESBIGEND			BIT_32(10)
#define _DWC3_GSBUSCFG0_DATBIGEND			BIT_32(11)
#define _DWC3_GSBUSCFG0_DESWRREQINFO_MASK		GENMASK_32(19, 16)
#define _DWC3_GSBUSCFG0_DESWRREQINFO_SHIFT		16
#define _DWC3_GSBUSCFG0_DATWRREQINFO_MASK		GENMASK_32(23, 20)
#define _DWC3_GSBUSCFG0_DATWRREQINFO_SHIFT		20
#define _DWC3_GSBUSCFG0_DESRDREQINFO_MASK		GENMASK_32(27, 24)
#define _DWC3_GSBUSCFG0_DESRDREQINFO_SHIFT		24
#define _DWC3_GSBUSCFG0_DATRDREQINFO_MASK		GENMASK_32(31, 28)
#define _DWC3_GSBUSCFG0_DATRDREQINFO_SHIFT		28

/* _DWC3_GSBUSCFG1 register fields */
#define _DWC3_GSBUSCFG1_PIPETRANSLIMIT_MASK		GENMASK_32(11, 8)
#define _DWC3_GSBUSCFG1_PIPETRANSLIMIT_SHIFT		8
#define _DWC3_GSBUSCFG1_EN1KPAGE			BIT_32(12)

/* _DWC3_GTXTHRCFG register fields */
#define _DWC3_GTXTHRCFG_USBMAXTXBURSTSIZE_MASK		GENMASK_32(23, 16)
#define _DWC3_GTXTHRCFG_USBMAXTXBURSTSIZE_SHIFT		16
#define _DWC3_GTXTHRCFG_USBTXPKTCNT_MASK		GENMASK_32(27, 24)
#define _DWC3_GTXTHRCFG_USBTXPKTCNT_SHIFT		24
#define _DWC3_GTXTHRCFG_USBTXPKTCNTSEL			BIT_32(29)

/* _DWC3_GRXTHRCFG register fields */
#define _DWC3_GRXTHRCFG_RESVISOCOUTSPC_MASK		GENMASK_32(12, 0)
#define _DWC3_GRXTHRCFG_RESVISOCOUTSPC_SHIFT		0
#define _DWC3_GRXTHRCFG_USBMAXRXBURSTSIZE_MASK		GENMASK_32(23, 19)
#define _DWC3_GRXTHRCFG_USBMAXRXBURSTSIZE_SHIFT		19
#define _DWC3_GRXTHRCFG_USBRXPKTCNT_MASK		GENMASK_32(27, 24)
#define _DWC3_GRXTHRCFG_USBRXPKTCNT_SHIFT		24
#define _DWC3_GRXTHRCFG_USBRXPKTCNTSEL			BIT_32(29)

/* _DWC3_GCTL register fields */
#define _DWC3_GCTL_DSBLCLKGTNG				BIT_32(0)
#define _DWC3_GCTL_GBLHIBERNATIONEN			BIT_32(1)
#define _DWC3_GCTL_U2EXIT_LFPS				BIT_32(2)
#define _DWC3_GCTL_DISSCRAMBLE				BIT_32(3)
#define _DWC3_GCTL_SCALEDOWN_MASK			GENMASK_32(5, 4)
#define _DWC3_GCTL_SCALEDOWN_SHIFT			4
#define _DWC3_GCTL_RAMCLKSEL_MASK			GENMASK_32(7, 6)
#define _DWC3_GCTL_RAMCLKSEL_SHIFT			6
#define _DWC3_GCTL_DEBUGATTACH				BIT_32(8)
#define _DWC3_GCTL_U1U2TIMERSCALE			BIT_32(9)
#define _DWC3_GCTL_SOFITPSYNC				BIT_32(10)
#define _DWC3_GCTL_CORESOFTRESET			BIT_32(11)
#define _DWC3_GCTL_PRTCAPDIR_MASK			GENMASK_32(13, 12)
#define _DWC3_GCTL_PRTCAPDIR_SHIFT			12
#define _DWC3_GCTL_FRMSCLDWN_MASK			GENMASK_32(15, 14)
#define _DWC3_GCTL_FRMSCLDWN_SHIFT			14
#define _DWC3_GCTL_U2RSTECN				BIT_32(16)
#define _DWC3_GCTL_BYPSSETADDR				BIT_32(17)
#define _DWC3_GCTL_MASTERFILTBYPASS			BIT_32(18)
#define _DWC3_GCTL_PWRDNSCALE_MASK			GENMASK_32(31, 19)
#define _DWC3_GCTL_PWRDNSCALE_SHIFT			19

/* _DWC3_GPMSTS register fields */
#define _DWC3_GPMSTS_U2WAKEUP_MASK			GENMASK_32(9, 0)
#define _DWC3_GPMSTS_U2WAKEUP_SHIFT			0
#define _DWC3_GPMSTS_U3WAKEUP_MASK			GENMASK_32(16, 12)
#define _DWC3_GPMSTS_U3WAKEUP_SHIFT			12
#define _DWC3_GPMSTS_PORTSEL_MASK			GENMASK_32(31, 28)
#define _DWC3_GPMSTS_PORTSEL_SHIFT			28

/* _DWC3_GSTS register fields */
#define _DWC3_GSTS_CURMOD_MASK				GENMASK_32(1, 0)
#define _DWC3_GSTS_CURMOD_SHIFT				0
#define _DWC3_GSTS_BUSERRADDRVLD			BIT_32(4)
#define _DWC3_GSTS_CSRTIMEOUT				BIT_32(5)
#define _DWC3_GSTS_DEVICE_IP				BIT_32(6)
#define _DWC3_GSTS_HOST_IP				BIT_32(7)
#define _DWC3_GSTS_ADP_IP				BIT_32(8)
#define _DWC3_GSTS_BC_IP				BIT_32(9)
#define _DWC3_GSTS_OTG_IP				BIT_32(10)
#define _DWC3_GSTS_SSIC_IP				BIT_32(11)
#define _DWC3_GSTS_CBELT_MASK				GENMASK_32(31, 20)
#define _DWC3_GSTS_CBELT_SHIFT				20

/* _DWC3_GUCTL1 register fields */
#define _DWC3_GUCTL1_LOA_FILTER_EN			BIT_32(0)
#define _DWC3_GUCTL1_OVRLD_L1_SUSP_COM			BIT_32(1)
#define _DWC3_GUCTL1_HC_PARCHK_DISABLE			BIT_32(2)
#define _DWC3_GUCTL1_HC_ERRATA_ENABLE			BIT_32(3)
#define _DWC3_GUCTL1_L1_SUSP_THRLD_FOR_HOST_MASK	GENMASK_32(7, 4)
#define _DWC3_GUCTL1_L1_SUSP_THRLD_FOR_HOST_SHIFT	4
#define _DWC3_GUCTL1_L1_SUSP_THRLD_EN_FOR_HOST		BIT_32(8)
#define _DWC3_GUCTL1_DEV_HS_NYET_BULK_SPR		BIT_32(9)
#define _DWC3_GUCTL1_RESUME_OPMODE_HS_HOST		BIT_32(10)
#define _DWC3_GUCTL1_PARKMODE_DISABLE_FSLS		BIT_32(15)
#define _DWC3_GUCTL1_PARKMODE_DISABLE_HS		BIT_32(16)
#define _DWC3_GUCTL1_PARKMODE_DISABLE_SS		BIT_32(17)
#define _DWC3_GUCTL1_NAK_PER_ENH_HS			BIT_32(18)
#define _DWC3_GUCTL1_NAK_PER_ENH_FS			BIT_32(19)
#define _DWC3_GUCTL1_DEV_LSP_TAIL_LOCK_DIS		BIT_32(20)
#define _DWC3_GUCTL1_IP_GAP_ADD_ON_MASK			GENMASK_32(23, 21)
#define _DWC3_GUCTL1_IP_GAP_ADD_ON_SHIFT		21
#define _DWC3_GUCTL1_DEV_L1_EXIT_BY_HW			BIT_32(24)
#define _DWC3_GUCTL1_P3_IN_U2				BIT_32(25)
#define _DWC3_GUCTL1_DEV_FORCE_20_CLK_FOR_30_CLK	BIT_32(26)
#define _DWC3_GUCTL1_DEV_TRB_OUT_SPR_IND		BIT_32(27)
#define _DWC3_GUCTL1_TX_IPGAP_LINECHECK_DIS		BIT_32(28)
#define _DWC3_GUCTL1_FILTER_SE0_FSLS_EOP		BIT_32(29)
#define _DWC3_GUCTL1_DS_RXDET_MAX_TOUT_CTRL		BIT_32(30)
#define _DWC3_GUCTL1_DEV_DECOUPLE_L1L2_EVT		BIT_32(31)

