DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/usb_dwc3/usb_dwc3_regs.h
/* _DWC3_GGPIO register fields */
#define _DWC3_GGPIO_GPI_MASK				GENMASK_32(15, 0)
#define _DWC3_GGPIO_GPI_SHIFT				0
#define _DWC3_GGPIO_GPO_MASK				GENMASK_32(31, 16)
#define _DWC3_GGPIO_GPO_SHIFT				16

/* _DWC3_GUCTL register fields */
#define _DWC3_GUCTL_DTFT_MASK				GENMASK_32(8, 0)
#define _DWC3_GUCTL_DTFT_SHIFT				0
#define _DWC3_GUCTL_DTCT_MASK				GENMASK_32(10, 9)
#define _DWC3_GUCTL_DTCT_SHIFT				9
#define _DWC3_GUCTL_INSRTEXTRFSBODI			BIT_32(11)
#define _DWC3_GUCTL_EXTCAPSUPPTEN			BIT_32(12)
#define _DWC3_GUCTL_ENOVERLAPCHK			BIT_32(13)
#define _DWC3_GUCTL_USBHSTINAUTORETRYEN			BIT_32(14)
#define _DWC3_GUCTL_RESBWHSEPS				BIT_32(16)
#define _DWC3_GUCTL_SPRSCTRLTRANSEN			BIT_32(17)
#define _DWC3_GUCTL_NOEXTRDL				BIT_32(21)
#define _DWC3_GUCTL_REFCLKPER_MASK			GENMASK_32(31, 22)
#define _DWC3_GUCTL_REFCLKPER_SHIFT			22

/* _DWC3_GPRTBIMAPLO register fields */
#define _DWC3_GPRTBIMAPLO_BINUM1_MASK			GENMASK_32(3, 0)
#define _DWC3_GPRTBIMAPLO_BINUM1_SHIFT			0
#define _DWC3_GPRTBIMAPLO_BINUM2_MASK			GENMASK_32(7, 4)
#define _DWC3_GPRTBIMAPLO_BINUM2_SHIFT			4
#define _DWC3_GPRTBIMAPLO_BINUM3_MASK			GENMASK_32(11, 8)
#define _DWC3_GPRTBIMAPLO_BINUM3_SHIFT			8
#define _DWC3_GPRTBIMAPLO_BINUM4_MASK			GENMASK_32(15, 12)
#define _DWC3_GPRTBIMAPLO_BINUM4_SHIFT			12
#define _DWC3_GPRTBIMAPLO_BINUM5_MASK			GENMASK_32(19, 16)
#define _DWC3_GPRTBIMAPLO_BINUM5_SHIFT			16
#define _DWC3_GPRTBIMAPLO_BINUM6_MASK			GENMASK_32(23, 20)
#define _DWC3_GPRTBIMAPLO_BINUM6_SHIFT			20
#define _DWC3_GPRTBIMAPLO_BINUM7_MASK			GENMASK_32(27, 24)
#define _DWC3_GPRTBIMAPLO_BINUM7_SHIFT			24
#define _DWC3_GPRTBIMAPLO_BINUM8_MASK			GENMASK_32(31, 28)
#define _DWC3_GPRTBIMAPLO_BINUM8_SHIFT			28

/* _DWC3_GPRTBIMAPHI register fields */
#define _DWC3_GPRTBIMAPHI_BINUM9_MASK			GENMASK_32(3, 0)
#define _DWC3_GPRTBIMAPHI_BINUM9_SHIFT			0
#define _DWC3_GPRTBIMAPHI_BINUM10_MASK			GENMASK_32(7, 4)
#define _DWC3_GPRTBIMAPHI_BINUM10_SHIFT			4
#define _DWC3_GPRTBIMAPHI_BINUM11_MASK			GENMASK_32(11, 8)
#define _DWC3_GPRTBIMAPHI_BINUM11_SHIFT			8
#define _DWC3_GPRTBIMAPHI_BINUM12_MASK			GENMASK_32(15, 12)
#define _DWC3_GPRTBIMAPHI_BINUM12_SHIFT			12
#define _DWC3_GPRTBIMAPHI_BINUM13_MASK			GENMASK_32(19, 16)
#define _DWC3_GPRTBIMAPHI_BINUM13_SHIFT			16
#define _DWC3_GPRTBIMAPHI_BINUM14_MASK			GENMASK_32(23, 20)
#define _DWC3_GPRTBIMAPHI_BINUM14_SHIFT			20
#define _DWC3_GPRTBIMAPHI_BINUM15_MASK			GENMASK_32(27, 24)
#define _DWC3_GPRTBIMAPHI_BINUM15_SHIFT			24

/* _DWC3_GHWPARAMS0 register fields */
#define _DWC3_GHWPARAMS0_GHWPARAMS0_2_0_MASK		GENMASK_32(2, 0)
#define _DWC3_GHWPARAMS0_GHWPARAMS0_2_0_SHIFT		0
#define _DWC3_GHWPARAMS0_GHWPARAMS0_5_3_MASK		GENMASK_32(5, 3)
#define _DWC3_GHWPARAMS0_GHWPARAMS0_5_3_SHIFT		3
#define _DWC3_GHWPARAMS0_GHWPARAMS0_7_6_MASK		GENMASK_32(7, 6)
#define _DWC3_GHWPARAMS0_GHWPARAMS0_7_6_SHIFT		6
#define _DWC3_GHWPARAMS0_GHWPARAMS0_15_8_MASK		GENMASK_32(15, 8)
#define _DWC3_GHWPARAMS0_GHWPARAMS0_15_8_SHIFT		8
#define _DWC3_GHWPARAMS0_GHWPARAMS0_23_16_MASK		GENMASK_32(23, 16)
#define _DWC3_GHWPARAMS0_GHWPARAMS0_23_16_SHIFT		16
#define _DWC3_GHWPARAMS0_GHWPARAMS0_31_24_MASK		GENMASK_32(31, 24)
#define _DWC3_GHWPARAMS0_GHWPARAMS0_31_24_SHIFT		24

/* _DWC3_GHWPARAMS1 register fields */
#define _DWC3_GHWPARAMS1_GHWPARAMS1_2_0_MASK		GENMASK_32(2, 0)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_2_0_SHIFT		0
#define _DWC3_GHWPARAMS1_GHWPARAMS1_5_3_MASK		GENMASK_32(5, 3)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_5_3_SHIFT		3
#define _DWC3_GHWPARAMS1_GHWPARAMS1_8_6_MASK		GENMASK_32(8, 6)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_8_6_SHIFT		6
#define _DWC3_GHWPARAMS1_GHWPARAMS1_11_9_MASK		GENMASK_32(11, 9)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_11_9_SHIFT		9
#define _DWC3_GHWPARAMS1_GHWPARAMS1_14_12_MASK		GENMASK_32(14, 12)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_14_12_SHIFT		12
#define _DWC3_GHWPARAMS1_GHWPARAMS1_20_15_MASK		GENMASK_32(20, 15)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_20_15_SHIFT		15
#define _DWC3_GHWPARAMS1_GHWPARAMS1_22_21_MASK		GENMASK_32(22, 21)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_22_21_SHIFT		21
#define _DWC3_GHWPARAMS1_GHWPARAMS1_23			BIT_32(23)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_25_24_MASK		GENMASK_32(25, 24)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_25_24_SHIFT		24
#define _DWC3_GHWPARAMS1_GHWPARAMS1_26			BIT_32(26)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_27			BIT_32(27)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_28			BIT_32(28)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_29			BIT_32(29)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_30			BIT_32(30)
#define _DWC3_GHWPARAMS1_GHWPARAMS1_31			BIT_32(31)

/* _DWC3_GHWPARAMS3 register fields */
#define _DWC3_GHWPARAMS3_GHWPARAMS3_1_0_MASK		GENMASK_32(1, 0)
#define _DWC3_GHWPARAMS3_GHWPARAMS3_1_0_SHIFT		0
#define _DWC3_GHWPARAMS3_GHWPARAMS3_3_2_MASK		GENMASK_32(3, 2)
#define _DWC3_GHWPARAMS3_GHWPARAMS3_3_2_SHIFT		2
#define _DWC3_GHWPARAMS3_GHWPARAMS3_5_4_MASK		GENMASK_32(5, 4)
#define _DWC3_GHWPARAMS3_GHWPARAMS3_5_4_SHIFT		4
#define _DWC3_GHWPARAMS3_GHWPARAMS3_7_6_MASK		GENMASK_32(7, 6)
#define _DWC3_GHWPARAMS3_GHWPARAMS3_7_6_SHIFT		6
#define _DWC3_GHWPARAMS3_GHWPARAMS3_9_8_MASK		GENMASK_32(9, 8)
#define _DWC3_GHWPARAMS3_GHWPARAMS3_9_8_SHIFT		8
#define _DWC3_GHWPARAMS3_GHWPARAMS3_10			BIT_32(10)
#define _DWC3_GHWPARAMS3_GHWPARAMS3_11			BIT_32(11)
#define _DWC3_GHWPARAMS3_GHWPARAMS3_17_12_MASK		GENMASK_32(17, 12)
#define _DWC3_GHWPARAMS3_GHWPARAMS3_17_12_SHIFT		12
#define _DWC3_GHWPARAMS3_GHWPARAMS3_22_18_MASK		GENMASK_32(22, 18)
#define _DWC3_GHWPARAMS3_GHWPARAMS3_22_18_SHIFT		18
#define _DWC3_GHWPARAMS3_GHWPARAMS3_30_23_MASK		GENMASK_32(30, 23)
#define _DWC3_GHWPARAMS3_GHWPARAMS3_30_23_SHIFT		23
#define _DWC3_GHWPARAMS3_GHWPARAMS3_31			BIT_32(31)

/* _DWC3_GHWPARAMS4 register fields */
#define _DWC3_GHWPARAMS4_GHWPARAMS4_5_0_MASK		GENMASK_32(5, 0)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_5_0_SHIFT		0
#define _DWC3_GHWPARAMS4_GHWPARAMS4_6			BIT_32(6)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_8_7_MASK		GENMASK_32(8, 7)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_8_7_SHIFT		7
#define _DWC3_GHWPARAMS4_GHWPARAMS4_10_9_MASK		GENMASK_32(10, 9)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_10_9_SHIFT		9
#define _DWC3_GHWPARAMS4_GHWPARAMS4_11			BIT_32(11)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_12			BIT_32(12)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_16_13_MASK		GENMASK_32(16, 13)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_16_13_SHIFT		13
#define _DWC3_GHWPARAMS4_GHWPARAMS4_20_17_MASK		GENMASK_32(20, 17)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_20_17_SHIFT		17
#define _DWC3_GHWPARAMS4_GHWPARAMS4_21			BIT_32(21)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_22			BIT_32(22)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_23			BIT_32(23)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_27_24_MASK		GENMASK_32(27, 24)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_27_24_SHIFT		24
#define _DWC3_GHWPARAMS4_GHWPARAMS4_31_28_MASK		GENMASK_32(31, 28)
#define _DWC3_GHWPARAMS4_GHWPARAMS4_31_28_SHIFT		28

/* _DWC3_GHWPARAMS5 register fields */
#define _DWC3_GHWPARAMS5_GHWPARAMS5_3_0_MASK		GENMASK_32(3, 0)
#define _DWC3_GHWPARAMS5_GHWPARAMS5_3_0_SHIFT		0
#define _DWC3_GHWPARAMS5_GHWPARAMS5_9_4_MASK		GENMASK_32(9, 4)
#define _DWC3_GHWPARAMS5_GHWPARAMS5_9_4_SHIFT		4
#define _DWC3_GHWPARAMS5_GHWPARAMS5_15_10_MASK		GENMASK_32(15, 10)
#define _DWC3_GHWPARAMS5_GHWPARAMS5_15_10_SHIFT		10
#define _DWC3_GHWPARAMS5_GHWPARAMS5_21_16_MASK		GENMASK_32(21, 16)
#define _DWC3_GHWPARAMS5_GHWPARAMS5_21_16_SHIFT		16
#define _DWC3_GHWPARAMS5_GHWPARAMS5_27_22_MASK		GENMASK_32(27, 22)
#define _DWC3_GHWPARAMS5_GHWPARAMS5_27_22_SHIFT		22
#define _DWC3_GHWPARAMS5_GHWPARAMS5_31_28_MASK		GENMASK_32(31, 28)
#define _DWC3_GHWPARAMS5_GHWPARAMS5_31_28_SHIFT		28

/* _DWC3_GHWPARAMS6 register fields */
#define _DWC3_GHWPARAMS6_GHWPARAMS6_5_0_MASK		GENMASK_32(5, 0)
#define _DWC3_GHWPARAMS6_GHWPARAMS6_5_0_SHIFT		0
#define _DWC3_GHWPARAMS6_GHWPARAMS6_6			BIT_32(6)
#define _DWC3_GHWPARAMS6_GHWPARAMS6_7			BIT_32(7)
#define _DWC3_GHWPARAMS6_GHWPARAMS6_9_8_MASK		GENMASK_32(9, 8)
#define _DWC3_GHWPARAMS6_GHWPARAMS6_9_8_SHIFT		8
#define _DWC3_GHWPARAMS6_SRPSUPPORT			BIT_32(10)
#define _DWC3_GHWPARAMS6_HNPSUPPORT			BIT_32(11)
#define _DWC3_GHWPARAMS6_ADPSUPPORT			BIT_32(12)
#define _DWC3_GHWPARAMS6_OTG_SS_SUPPORT			BIT_32(13)
#define _DWC3_GHWPARAMS6_BCSUPPORT			BIT_32(14)
#define _DWC3_GHWPARAMS6_BUSFLTRSSUPPORT		BIT_32(15)
#define _DWC3_GHWPARAMS6_GHWPARAMS6_31_16_MASK		GENMASK_32(31, 16)
#define _DWC3_GHWPARAMS6_GHWPARAMS6_31_16_SHIFT		16

/* _DWC3_GHWPARAMS7 register fields */
#define _DWC3_GHWPARAMS7_GHWPARAMS7_15_0_MASK		GENMASK_32(15, 0)
#define _DWC3_GHWPARAMS7_GHWPARAMS7_15_0_SHIFT		0
#define _DWC3_GHWPARAMS7_GHWPARAMS7_31_16_MASK		GENMASK_32(31, 16)
#define _DWC3_GHWPARAMS7_GHWPARAMS7_31_16_SHIFT		16

/* _DWC3_GDBGFIFOSPACE register fields */
#define _DWC3_GDBGFIFOSPACE_FIFO_QUEUE_SELECT_MASK	GENMASK_32(8, 0)
#define _DWC3_GDBGFIFOSPACE_FIFO_QUEUE_SELECT_SHIFT	0
#define _DWC3_GDBGFIFOSPACE_SPACE_AVAILABLE_MASK	GENMASK_32(31, 16)
#define _DWC3_GDBGFIFOSPACE_SPACE_AVAILABLE_SHIFT	16

/* _DWC3_GDBGLTSSM register fields */
#define _DWC3_GDBGLTSSM_TXONESZEROS			BIT_32(0)
#define _DWC3_GDBGLTSSM_RXTERMINATION			BIT_32(1)
#define _DWC3_GDBGLTSSM_TXSWING				BIT_32(2)
#define _DWC3_GDBGLTSSM_LTDBCLKSTATE_MASK		GENMASK_32(5, 3)
#define _DWC3_GDBGLTSSM_LTDBCLKSTATE_SHIFT		3
#define _DWC3_GDBGLTSSM_TXDEEMPHASIS_MASK		GENMASK_32(7, 6)
#define _DWC3_GDBGLTSSM_TXDEEMPHASIS_SHIFT		6
#define _DWC3_GDBGLTSSM_RXEQTRAIN			BIT_32(8)
#define _DWC3_GDBGLTSSM_POWERDOWN_MASK			GENMASK_32(10, 9)
#define _DWC3_GDBGLTSSM_POWERDOWN_SHIFT			9
#define _DWC3_GDBGLTSSM_LTDBPHYCMDSTATE_MASK		GENMASK_32(13, 11)
#define _DWC3_GDBGLTSSM_LTDBPHYCMDSTATE_SHIFT		11
#define _DWC3_GDBGLTSSM_TXDETRXLOOPBACK			BIT_32(14)
#define _DWC3_GDBGLTSSM_RXPOLARITY			BIT_32(15)
#define _DWC3_GDBGLTSSM_TXELECLDLE			BIT_32(16)
#define _DWC3_GDBGLTSSM_ELASTICBUFFERMODE		BIT_32(17)
#define _DWC3_GDBGLTSSM_LTDBSUBSTATE_MASK		GENMASK_32(21, 18)
#define _DWC3_GDBGLTSSM_LTDBSUBSTATE_SHIFT		18
#define _DWC3_GDBGLTSSM_LTDBLINKSTATE_MASK		GENMASK_32(25, 22)
#define _DWC3_GDBGLTSSM_LTDBLINKSTATE_SHIFT		22
#define _DWC3_GDBGLTSSM_LTDBTIMEOUT			BIT_32(26)
#define _DWC3_GDBGLTSSM_PRTDIRECTION			BIT_32(27)
#define _DWC3_GDBGLTSSM_X3_DS_HOST_SHUTDOWN		BIT_32(28)
#define _DWC3_GDBGLTSSM_X3_XS_SWAPPING			BIT_32(29)
#define _DWC3_GDBGLTSSM_RXELECIDLE			BIT_32(30)

