DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/usb_dwc3/usb_dwc3_regs.h
/* _DWC3_GDBGLNMCC register fields */
#define _DWC3_GDBGLNMCC_LNMCC_BERC_MASK			GENMASK_32(8, 0)
#define _DWC3_GDBGLNMCC_LNMCC_BERC_SHIFT		0

/* _DWC3_GDBGBMU register fields */
#define _DWC3_GDBGBMU_BMU_CCU_MASK			GENMASK_32(3, 0)
#define _DWC3_GDBGBMU_BMU_CCU_SHIFT			0
#define _DWC3_GDBGBMU_BMU_DCU_MASK			GENMASK_32(7, 4)
#define _DWC3_GDBGBMU_BMU_DCU_SHIFT			4
#define _DWC3_GDBGBMU_BMU_BCU_MASK			GENMASK_32(31, 8)
#define _DWC3_GDBGBMU_BMU_BCU_SHIFT			8

/* _DWC3_GDBGLSPMUX_HST register fields */
#define _DWC3_GDBGLSPMUX_HST_HOSTSELECT_MASK		GENMASK_32(13, 0)
#define _DWC3_GDBGLSPMUX_HST_HOSTSELECT_SHIFT		0
#define _DWC3_GDBGLSPMUX_HST_LOGIC_ANALYZER_TRACE_MASK	GENMASK_32(23, 16)
#define _DWC3_GDBGLSPMUX_HST_LOGIC_ANALYZER_TRACE_SHIFT	16

/* _DWC3_GPRTBIMAP_HSLO register fields */
#define _DWC3_GPRTBIMAP_HSLO_BINUM1_MASK		GENMASK_32(3, 0)
#define _DWC3_GPRTBIMAP_HSLO_BINUM1_SHIFT		0
#define _DWC3_GPRTBIMAP_HSLO_BINUM2_MASK		GENMASK_32(7, 4)
#define _DWC3_GPRTBIMAP_HSLO_BINUM2_SHIFT		4
#define _DWC3_GPRTBIMAP_HSLO_BINUM3_MASK		GENMASK_32(11, 8)
#define _DWC3_GPRTBIMAP_HSLO_BINUM3_SHIFT		8
#define _DWC3_GPRTBIMAP_HSLO_BINUM4_MASK		GENMASK_32(15, 12)
#define _DWC3_GPRTBIMAP_HSLO_BINUM4_SHIFT		12
#define _DWC3_GPRTBIMAP_HSLO_BINUM5_MASK		GENMASK_32(19, 16)
#define _DWC3_GPRTBIMAP_HSLO_BINUM5_SHIFT		16
#define _DWC3_GPRTBIMAP_HSLO_BINUM6_MASK		GENMASK_32(23, 20)
#define _DWC3_GPRTBIMAP_HSLO_BINUM6_SHIFT		20
#define _DWC3_GPRTBIMAP_HSLO_BINUM7_MASK		GENMASK_32(27, 24)
#define _DWC3_GPRTBIMAP_HSLO_BINUM7_SHIFT		24
#define _DWC3_GPRTBIMAP_HSLO_BINUM8_MASK		GENMASK_32(31, 28)
#define _DWC3_GPRTBIMAP_HSLO_BINUM8_SHIFT		28

/* _DWC3_GPRTBIMAP_HSHI register fields */
#define _DWC3_GPRTBIMAP_HSHI_BINUM9_MASK		GENMASK_32(3, 0)
#define _DWC3_GPRTBIMAP_HSHI_BINUM9_SHIFT		0
#define _DWC3_GPRTBIMAP_HSHI_BINUM10_MASK		GENMASK_32(7, 4)
#define _DWC3_GPRTBIMAP_HSHI_BINUM10_SHIFT		4
#define _DWC3_GPRTBIMAP_HSHI_BINUM11_MASK		GENMASK_32(11, 8)
#define _DWC3_GPRTBIMAP_HSHI_BINUM11_SHIFT		8
#define _DWC3_GPRTBIMAP_HSHI_BINUM12_MASK		GENMASK_32(15, 12)
#define _DWC3_GPRTBIMAP_HSHI_BINUM12_SHIFT		12
#define _DWC3_GPRTBIMAP_HSHI_BINUM13_MASK		GENMASK_32(19, 16)
#define _DWC3_GPRTBIMAP_HSHI_BINUM13_SHIFT		16
#define _DWC3_GPRTBIMAP_HSHI_BINUM14_MASK		GENMASK_32(23, 20)
#define _DWC3_GPRTBIMAP_HSHI_BINUM14_SHIFT		20
#define _DWC3_GPRTBIMAP_HSHI_BINUM15_MASK		GENMASK_32(27, 24)
#define _DWC3_GPRTBIMAP_HSHI_BINUM15_SHIFT		24

/* _DWC3_GPRTBIMAP_FSLO register fields */
#define _DWC3_GPRTBIMAP_FSLO_BINUM1_MASK		GENMASK_32(3, 0)
#define _DWC3_GPRTBIMAP_FSLO_BINUM1_SHIFT		0
#define _DWC3_GPRTBIMAP_FSLO_BINUM2_MASK		GENMASK_32(7, 4)
#define _DWC3_GPRTBIMAP_FSLO_BINUM2_SHIFT		4
#define _DWC3_GPRTBIMAP_FSLO_BINUM3_MASK		GENMASK_32(11, 8)
#define _DWC3_GPRTBIMAP_FSLO_BINUM3_SHIFT		8
#define _DWC3_GPRTBIMAP_FSLO_BINUM4_MASK		GENMASK_32(15, 12)
#define _DWC3_GPRTBIMAP_FSLO_BINUM4_SHIFT		12
#define _DWC3_GPRTBIMAP_FSLO_BINUM5_MASK		GENMASK_32(19, 16)
#define _DWC3_GPRTBIMAP_FSLO_BINUM5_SHIFT		16
#define _DWC3_GPRTBIMAP_FSLO_BINUM6_MASK		GENMASK_32(23, 20)
#define _DWC3_GPRTBIMAP_FSLO_BINUM6_SHIFT		20
#define _DWC3_GPRTBIMAP_FSLO_BINUM7_MASK		GENMASK_32(27, 24)
#define _DWC3_GPRTBIMAP_FSLO_BINUM7_SHIFT		24
#define _DWC3_GPRTBIMAP_FSLO_BINUM8_MASK		GENMASK_32(31, 28)
#define _DWC3_GPRTBIMAP_FSLO_BINUM8_SHIFT		28

/* _DWC3_GPRTBIMAP_FSHI register fields */
#define _DWC3_GPRTBIMAP_FSHI_BINUM9_MASK		GENMASK_32(3, 0)
#define _DWC3_GPRTBIMAP_FSHI_BINUM9_SHIFT		0
#define _DWC3_GPRTBIMAP_FSHI_BINUM10_MASK		GENMASK_32(7, 4)
#define _DWC3_GPRTBIMAP_FSHI_BINUM10_SHIFT		4
#define _DWC3_GPRTBIMAP_FSHI_BINUM11_MASK		GENMASK_32(11, 8)
#define _DWC3_GPRTBIMAP_FSHI_BINUM11_SHIFT		8
#define _DWC3_GPRTBIMAP_FSHI_BINUM12_MASK		GENMASK_32(15, 12)
#define _DWC3_GPRTBIMAP_FSHI_BINUM12_SHIFT		12
#define _DWC3_GPRTBIMAP_FSHI_BINUM13_MASK		GENMASK_32(19, 16)
#define _DWC3_GPRTBIMAP_FSHI_BINUM13_SHIFT		16
#define _DWC3_GPRTBIMAP_FSHI_BINUM14_MASK		GENMASK_32(23, 20)
#define _DWC3_GPRTBIMAP_FSHI_BINUM14_SHIFT		20
#define _DWC3_GPRTBIMAP_FSHI_BINUM15_MASK		GENMASK_32(27, 24)
#define _DWC3_GPRTBIMAP_FSHI_BINUM15_SHIFT		24

/* _DWC3_GUCTL2 register fields */
#define _DWC3_GUCTL2_TXPINGDURATION_MASK		GENMASK_32(4, 0)
#define _DWC3_GUCTL2_TXPINGDURATION_SHIFT		0
#define _DWC3_GUCTL2_RXPINGDURATION_MASK		GENMASK_32(10, 5)
#define _DWC3_GUCTL2_RXPINGDURATION_SHIFT		5
#define _DWC3_GUCTL2_DISABLECFC				BIT_32(11)
#define _DWC3_GUCTL2_ENABLEEPCACHEEVICT			BIT_32(12)
#define _DWC3_GUCTL2_RST_ACTBITLATER			BIT_32(14)
#define _DWC3_GUCTL2_NOLOWPWRDUR_MASK			GENMASK_32(18, 15)
#define _DWC3_GUCTL2_NOLOWPWRDUR_SHIFT			15
#define _DWC3_GUCTL2_EN_HP_PM_TIMER_MASK		GENMASK_32(25, 19)
#define _DWC3_GUCTL2_EN_HP_PM_TIMER_SHIFT		19

/* _DWC3_GTXFIFOPRIDEV register fields */
#define _DWC3_GTXFIFOPRIDEV_GTXFIFOPRIDEV_MASK		GENMASK_32(11, 0)
#define _DWC3_GTXFIFOPRIDEV_GTXFIFOPRIDEV_SHIFT		0

/* _DWC3_GTXFIFOPRIHST register fields */
#define _DWC3_GTXFIFOPRIHST_GTXFIFOPRIHST_MASK		GENMASK_32(2, 0)
#define _DWC3_GTXFIFOPRIHST_GTXFIFOPRIHST_SHIFT		0

/* _DWC3_GRXFIFOPRIHST register fields */
#define _DWC3_GRXFIFOPRIHST_GRXFIFOPRIHST_MASK		GENMASK_32(2, 0)
#define _DWC3_GRXFIFOPRIHST_GRXFIFOPRIHST_SHIFT		0

/* _DWC3_GDMAHLRATIO register fields */
#define _DWC3_GDMAHLRATIO_HSTTXFIFO_MASK		GENMASK_32(4, 0)
#define _DWC3_GDMAHLRATIO_HSTTXFIFO_SHIFT		0
#define _DWC3_GDMAHLRATIO_HSTRXFIFO_MASK		GENMASK_32(12, 8)
#define _DWC3_GDMAHLRATIO_HSTRXFIFO_SHIFT		8

/* _DWC3_GFLADJ register fields */
#define _DWC3_GFLADJ_GFLADJ_30MHZ_MASK			GENMASK_32(5, 0)
#define _DWC3_GFLADJ_GFLADJ_30MHZ_SHIFT			0
#define _DWC3_GFLADJ_GFLADJ_30MHZ_SDBND_SEL		BIT_32(7)
#define _DWC3_GFLADJ_GFLADJ_REFCLK_FLADJ_MASK		GENMASK_32(21, 8)
#define _DWC3_GFLADJ_GFLADJ_REFCLK_FLADJ_SHIFT		8
#define _DWC3_GFLADJ_GFLADJ_REFCLK_LPM_SEL		BIT_32(23)
#define _DWC3_GFLADJ_GFLADJ_REFCLK_240MHZ_DECR_MASK	GENMASK_32(30, 24)
#define _DWC3_GFLADJ_GFLADJ_REFCLK_240MHZ_DECR_SHIFT	24
#define _DWC3_GFLADJ_GFLADJ_REFCLK_240MHZDECR_PLS1	BIT_32(31)

/* _DWC3_GUSB2PHYCFG register fields */
#define _DWC3_GUSB2PHYCFG_TOUTCAL_MASK			GENMASK_32(2, 0)
#define _DWC3_GUSB2PHYCFG_TOUTCAL_SHIFT			0
#define _DWC3_GUSB2PHYCFG_PHYIF				BIT_32(3)
#define _DWC3_GUSB2PHYCFG_ULPI_UTMI_SEL			BIT_32(4)
#define _DWC3_GUSB2PHYCFG_FSINTF			BIT_32(5)
#define _DWC3_GUSB2PHYCFG_SUSPENDUSB20			BIT_32(6)
#define _DWC3_GUSB2PHYCFG_PHYSEL			BIT_32(7)
#define _DWC3_GUSB2PHYCFG_ENBLSLPM			BIT_32(8)
#define _DWC3_GUSB2PHYCFG_XCVRDLY			BIT_32(9)
#define _DWC3_GUSB2PHYCFG_USBTRDTIM_MASK		GENMASK_32(13, 10)
#define _DWC3_GUSB2PHYCFG_USBTRDTIM_SHIFT		10
#define _DWC3_GUSB2PHYCFG_ULPIAUTORES			BIT_32(15)
#define _DWC3_GUSB2PHYCFG_ULPIEXTVBUSDRV		BIT_32(17)
#define _DWC3_GUSB2PHYCFG_ULPIEXTVBUSINDIACTOR		BIT_32(18)
#define _DWC3_GUSB2PHYCFG_LSIPD_MASK			GENMASK_32(21, 19)
#define _DWC3_GUSB2PHYCFG_LSIPD_SHIFT			19
#define _DWC3_GUSB2PHYCFG_LSTRD_MASK			GENMASK_32(24, 22)
#define _DWC3_GUSB2PHYCFG_LSTRD_SHIFT			22
#define _DWC3_GUSB2PHYCFG_INV_SEL_HSIC			BIT_32(26)
#define _DWC3_GUSB2PHYCFG_HSIC_CON_WIDTH_ADJ_MASK	GENMASK_32(28, 27)
#define _DWC3_GUSB2PHYCFG_HSIC_CON_WIDTH_ADJ_SHIFT	27
#define _DWC3_GUSB2PHYCFG_ULPI_LPM_WITH_OPMODE_CHK	BIT_32(29)
#define _DWC3_GUSB2PHYCFG_U2_FREECLK_EXISTS		BIT_32(30)
#define _DWC3_GUSB2PHYCFG_PHYSOFTRST			BIT_32(31)

