DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/usb_dwc3/usb_dwc3_regs.h
/* _DWC3_GUSB2PHYACC_ULPI register fields */
#define _DWC3_GUSB2PHYACC_ULPI_REGDATA_MASK		GENMASK_32(7, 0)
#define _DWC3_GUSB2PHYACC_ULPI_REGDATA_SHIFT		0
#define _DWC3_GUSB2PHYACC_ULPI_EXTREGADDR_MASK		GENMASK_32(15, 8)
#define _DWC3_GUSB2PHYACC_ULPI_EXTREGADDR_SHIFT		8
#define _DWC3_GUSB2PHYACC_ULPI_REGADDR_MASK		GENMASK_32(21, 16)
#define _DWC3_GUSB2PHYACC_ULPI_REGADDR_SHIFT		16
#define _DWC3_GUSB2PHYACC_ULPI_REGWR			BIT_32(22)
#define _DWC3_GUSB2PHYACC_ULPI_VSTSBSY			BIT_32(23)
#define _DWC3_GUSB2PHYACC_ULPI_VSTSDONE			BIT_32(24)
#define _DWC3_GUSB2PHYACC_ULPI_NEWREGREQ		BIT_32(25)
#define _DWC3_GUSB2PHYACC_ULPI_DISUIPIDRVR		BIT_32(26)

/* _DWC3_GUSB3PIPECTL register fields */
#define _DWC3_GUSB3PIPECTL_ELASTIC_BUFFER_MODE		BIT_32(0)
#define _DWC3_GUSB3PIPECTL_SS_TX_DE_EMPHASIS_MASK	GENMASK_32(2, 1)
#define _DWC3_GUSB3PIPECTL_SS_TX_DE_EMPHASIS_SHIFT	1
#define _DWC3_GUSB3PIPECTL_TX_MARGIN_MASK		GENMASK_32(5, 3)
#define _DWC3_GUSB3PIPECTL_TX_MARGIN_SHIFT		3
#define _DWC3_GUSB3PIPECTL_TX_SWING			BIT_32(6)
#define _DWC3_GUSB3PIPECTL_SSICEN			BIT_32(7)
#define _DWC3_GUSB3PIPECTL_RX_DETECT_TO_POLLING_LFPS_CONTROL	BIT_32(8)
#define _DWC3_GUSB3PIPECTL_LFPSFILTER			BIT_32(9)
#define _DWC3_GUSB3PIPECTL_P3EXSIGP2			BIT_32(10)
#define _DWC3_GUSB3PIPECTL_P3P2TRANOK			BIT_32(11)
#define _DWC3_GUSB3PIPECTL_LFPSP0ALGN			BIT_32(12)
#define _DWC3_GUSB3PIPECTL_SKIPRXDET			BIT_32(13)
#define _DWC3_GUSB3PIPECTL_ABORTRXDETINU2		BIT_32(14)
#define _DWC3_GUSB3PIPECTL_DATWIDTH_MASK		GENMASK_32(16, 15)
#define _DWC3_GUSB3PIPECTL_DATWIDTH_SHIFT		15
#define _DWC3_GUSB3PIPECTL_SUSPENDENABLE		BIT_32(17)
#define _DWC3_GUSB3PIPECTL_DELAYP1TRANS			BIT_32(18)
#define _DWC3_GUSB3PIPECTL_DELAYP1P2P3_MASK		GENMASK_32(21, 19)
#define _DWC3_GUSB3PIPECTL_DELAYP1P2P3_SHIFT		19
#define _DWC3_GUSB3PIPECTL_DISRXDETU3RXDET		BIT_32(22)
#define _DWC3_GUSB3PIPECTL_STARTRXDETU3RXDET		BIT_32(23)
#define _DWC3_GUSB3PIPECTL_REQUEST_P1P2P3		BIT_32(24)
#define _DWC3_GUSB3PIPECTL_U1U2EXITFAIL_TO_RECOV	BIT_32(25)
#define _DWC3_GUSB3PIPECTL_PING_ENHANCEMENT_EN		BIT_32(26)
#define _DWC3_GUSB3PIPECTL_UX_EXIT_IN_PX		BIT_32(27)
#define _DWC3_GUSB3PIPECTL_DISRXDETP3			BIT_32(28)
#define _DWC3_GUSB3PIPECTL_U2P3OK			BIT_32(29)
#define _DWC3_GUSB3PIPECTL_HSTPRTCMPL			BIT_32(30)
#define _DWC3_GUSB3PIPECTL_PHYSOFTRST			BIT_32(31)

/* _DWC3_GTXFIFOSIZ0 register fields */
#define _DWC3_GTXFIFOSIZ0_TXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GTXFIFOSIZ0_TXFDEP_N_SHIFT		0
#define _DWC3_GTXFIFOSIZ0_TXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GTXFIFOSIZ0_TXFSTADDR_N_SHIFT		16

/* _DWC3_GTXFIFOSIZ1 register fields */
#define _DWC3_GTXFIFOSIZ1_TXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GTXFIFOSIZ1_TXFDEP_N_SHIFT		0
#define _DWC3_GTXFIFOSIZ1_TXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GTXFIFOSIZ1_TXFSTADDR_N_SHIFT		16

/* _DWC3_GTXFIFOSIZ2 register fields */
#define _DWC3_GTXFIFOSIZ2_TXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GTXFIFOSIZ2_TXFDEP_N_SHIFT		0
#define _DWC3_GTXFIFOSIZ2_TXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GTXFIFOSIZ2_TXFSTADDR_N_SHIFT		16

/* _DWC3_GTXFIFOSIZ3 register fields */
#define _DWC3_GTXFIFOSIZ3_TXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GTXFIFOSIZ3_TXFDEP_N_SHIFT		0
#define _DWC3_GTXFIFOSIZ3_TXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GTXFIFOSIZ3_TXFSTADDR_N_SHIFT		16

/* _DWC3_GTXFIFOSIZ4 register fields */
#define _DWC3_GTXFIFOSIZ4_TXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GTXFIFOSIZ4_TXFDEP_N_SHIFT		0
#define _DWC3_GTXFIFOSIZ4_TXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GTXFIFOSIZ4_TXFSTADDR_N_SHIFT		16

/* _DWC3_GTXFIFOSIZ5 register fields */
#define _DWC3_GTXFIFOSIZ5_TXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GTXFIFOSIZ5_TXFDEP_N_SHIFT		0
#define _DWC3_GTXFIFOSIZ5_TXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GTXFIFOSIZ5_TXFSTADDR_N_SHIFT		16

/* _DWC3_GTXFIFOSIZ6 register fields */
#define _DWC3_GTXFIFOSIZ6_TXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GTXFIFOSIZ6_TXFDEP_N_SHIFT		0
#define _DWC3_GTXFIFOSIZ6_TXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GTXFIFOSIZ6_TXFSTADDR_N_SHIFT		16

/* _DWC3_GTXFIFOSIZ7 register fields */
#define _DWC3_GTXFIFOSIZ7_TXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GTXFIFOSIZ7_TXFDEP_N_SHIFT		0
#define _DWC3_GTXFIFOSIZ7_TXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GTXFIFOSIZ7_TXFSTADDR_N_SHIFT		16

/* _DWC3_GTXFIFOSIZ8 register fields */
#define _DWC3_GTXFIFOSIZ8_TXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GTXFIFOSIZ8_TXFDEP_N_SHIFT		0
#define _DWC3_GTXFIFOSIZ8_TXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GTXFIFOSIZ8_TXFSTADDR_N_SHIFT		16

/* _DWC3_GTXFIFOSIZ9 register fields */
#define _DWC3_GTXFIFOSIZ9_TXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GTXFIFOSIZ9_TXFDEP_N_SHIFT		0
#define _DWC3_GTXFIFOSIZ9_TXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GTXFIFOSIZ9_TXFSTADDR_N_SHIFT		16

/* _DWC3_GTXFIFOSIZ10 register fields */
#define _DWC3_GTXFIFOSIZ10_TXFDEP_N_MASK		GENMASK_32(15, 0)
#define _DWC3_GTXFIFOSIZ10_TXFDEP_N_SHIFT		0
#define _DWC3_GTXFIFOSIZ10_TXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GTXFIFOSIZ10_TXFSTADDR_N_SHIFT		16

/* _DWC3_GTXFIFOSIZ11 register fields */
#define _DWC3_GTXFIFOSIZ11_TXFDEP_N_MASK		GENMASK_32(15, 0)
#define _DWC3_GTXFIFOSIZ11_TXFDEP_N_SHIFT		0
#define _DWC3_GTXFIFOSIZ11_TXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GTXFIFOSIZ11_TXFSTADDR_N_SHIFT		16

/* _DWC3_GRXFIFOSIZ0 register fields */
#define _DWC3_GRXFIFOSIZ0_RXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GRXFIFOSIZ0_RXFDEP_N_SHIFT		0
#define _DWC3_GRXFIFOSIZ0_RXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GRXFIFOSIZ0_RXFSTADDR_N_SHIFT		16

/* _DWC3_GRXFIFOSIZ1 register fields */
#define _DWC3_GRXFIFOSIZ1_RXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GRXFIFOSIZ1_RXFDEP_N_SHIFT		0
#define _DWC3_GRXFIFOSIZ1_RXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GRXFIFOSIZ1_RXFSTADDR_N_SHIFT		16

/* _DWC3_GRXFIFOSIZ2 register fields */
#define _DWC3_GRXFIFOSIZ2_RXFDEP_N_MASK			GENMASK_32(15, 0)
#define _DWC3_GRXFIFOSIZ2_RXFDEP_N_SHIFT		0
#define _DWC3_GRXFIFOSIZ2_RXFSTADDR_N_MASK		GENMASK_32(31, 16)
#define _DWC3_GRXFIFOSIZ2_RXFSTADDR_N_SHIFT		16

