DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/usb_dwc3/usb_dwc3_regs.h
/* _DWC3_GEVNTSIZ register fields */
#define _DWC3_GEVNTSIZ_EVENTSIZ_MASK			GENMASK_32(15, 0)
#define _DWC3_GEVNTSIZ_EVENTSIZ_SHIFT			0
#define _DWC3_GEVNTSIZ_EVNTINTRPTMASK			BIT_32(31)

/* _DWC3_GEVNTCOUNT register fields */
#define _DWC3_GEVNTCOUNT_EVNTCOUNT_MASK			GENMASK_32(15, 0)
#define _DWC3_GEVNTCOUNT_EVNTCOUNT_SHIFT		0
#define _DWC3_GEVNTCOUNT_EVNT_HANDLER_BUSY		BIT_32(31)

/*
 * USB3 Device Register Block
 */
#define _DWC3_DCFG					U(0x0)
#define _DWC3_DCTL					U(0x4)
#define _DWC3_DEVTEN					U(0x8)
#define _DWC3_DSTS					U(0xC)
#define _DWC3_DGCMDPAR					U(0x10)
#define _DWC3_DGCMD					U(0x14)
#define _DWC3_DALEPENA					U(0x20)
#define _DWC3_DEPCMDPAR2				U(0x100)
#define _DWC3_DEPCMDPAR1				U(0x104)
#define _DWC3_DEPCMDPAR0				U(0x108)
#define _DWC3_DEPCMD					U(0x10c)
#define _DWC3_DEV_IMOD					U(0x300)

/* _DWC3_DCFG register fields */
#define _DWC3_DCFG_DEVSPD_MASK				GENMASK_32(2, 0)
#define _DWC3_DCFG_DEVSPD_SHIFT				0
#define _DWC3_DCFG_DEVADDR_MASK				GENMASK_32(9, 3)
#define _DWC3_DCFG_DEVADDR_SHIFT			3
#define _DWC3_DCFG_INTRNUM_MASK				GENMASK_32(16, 12)
#define _DWC3_DCFG_INTRNUM_SHIFT			12
#define _DWC3_DCFG_NUMP_MASK				GENMASK_32(21, 17)
#define _DWC3_DCFG_NUMP_SHIFT				17
#define _DWC3_DCFG_LPMCAP				BIT_32(22)
#define _DWC3_DCFG_IGNSTRMPP				BIT_32(23)

/* _DWC3_DCTL register fields */
#define _DWC3_DCTL_TSTCTL_MASK				GENMASK_32(4, 1)
#define _DWC3_DCTL_TSTCTL_SHIFT				1
#define _DWC3_DCTL_ULSTCHNGREQ_MASK			GENMASK_32(8, 5)
#define _DWC3_DCTL_ULSTCHNGREQ_SHIFT			5
#define _DWC3_DCTL_ACCEPTU1ENA				BIT_32(9)
#define _DWC3_DCTL_INITU1ENA				BIT_32(10)
#define _DWC3_DCTL_ACCEPTU2ENA				BIT_32(11)
#define _DWC3_DCTL_INITU2ENA				BIT_32(12)
#define _DWC3_DCTL_CSS					BIT_32(16)
#define _DWC3_DCTL_CRS					BIT_32(17)
#define _DWC3_DCTL_L1HIBERNATIONEN			BIT_32(18)
#define _DWC3_DCTL_KEEPCONNECT				BIT_32(19)
#define _DWC3_DCTL_LPM_NYET_THRES_MASK			GENMASK_32(23, 20)
#define _DWC3_DCTL_LPM_NYET_THRES_SHIFT			20
#define _DWC3_DCTL_HIRDTHRES_MASK			GENMASK_32(28, 24)
#define _DWC3_DCTL_HIRDTHRES_SHIFT			24
#define _DWC3_DCTL_CSFTRST				BIT_32(30)
#define _DWC3_DCTL_RUN_STOP				BIT_32(31)

/* _DWC3_DEVTEN register fields */
#define _DWC3_DEVTEN_DISSCONNEVTEN			BIT_32(0)
#define _DWC3_DEVTEN_USBRSTEVTEN			BIT_32(1)
#define _DWC3_DEVTEN_CONNECTDONEEVTEN			BIT_32(2)
#define _DWC3_DEVTEN_ULSTCNGEN				BIT_32(3)
#define _DWC3_DEVTEN_WKUPEVTEN				BIT_32(4)
#define _DWC3_DEVTEN_HIBERNATIONREQEVTEN		BIT_32(5)
#define _DWC3_DEVTEN_U3L2L1SUSPEN			BIT_32(6)
#define _DWC3_DEVTEN_SOFTEVTEN				BIT_32(7)
#define _DWC3_DEVTEN_L1SUSPEN				BIT_32(8)
#define _DWC3_DEVTEN_ERRTICERREVTEN			BIT_32(9)
#define _DWC3_DEVTEN_CMDCMPLTEN				BIT_32(10)
#define _DWC3_DEVTEN_EVNTOVERFLOWEN			BIT_32(11)
#define _DWC3_DEVTEN_VENDEVTSTRCVDEN			BIT_32(12)
#define _DWC3_DEVTEN_L1WKUPEVTEN			BIT_32(14)
#define _DWC3_DEVTEN_ECCERREN				BIT_32(16)

/* _DWC3_DSTS register fields */
#define _DWC3_DSTS_CONNECTSPD_MASK			GENMASK_32(2, 0)
#define _DWC3_DSTS_CONNECTSPD_SHIFT			0
#define _DWC3_DSTS_SOFFN_MASK				GENMASK_32(16, 3)
#define _DWC3_DSTS_SOFFN_SHIFT				3
#define _DWC3_DSTS_RXFIFOEMPTY				BIT_32(17)
#define _DWC3_DSTS_USBLNKST_MASK			GENMASK_32(21, 18)
#define _DWC3_DSTS_USBLNKST_SHIFT			18
#define _DWC3_DSTS_DEVCTRLHLT				BIT_32(22)
#define _DWC3_DSTS_COREIDLE				BIT_32(23)
#define _DWC3_DSTS_SSS					BIT_32(24)
#define _DWC3_DSTS_RSS					BIT_32(25)
#define _DWC3_DSTS_SRE					BIT_32(28)
#define _DWC3_DSTS_DCNRD				BIT_32(29)

/* _DWC3_DGCMD register fields */
#define _DWC3_DGCMD_CMDTYP_MASK				GENMASK_32(7, 0)
#define _DWC3_DGCMD_CMDTYP_SHIFT			0
#define _DWC3_DGCMD_CMDIOC				BIT_32(8)
#define _DWC3_DGCMD_CMDACT				BIT_32(10)
#define _DWC3_DGCMD_CMDSTATUS_MASK			GENMASK_32(15, 12)
#define _DWC3_DGCMD_CMDSTATUS_SHIFT			12

/* _DWC3_DEPCMD register fields */
#define _DWC3_DEPCMD_CMDTYP_MASK			GENMASK_32(3, 0)
#define _DWC3_DEPCMD_CMDTYP_SHIFT			0
#define _DWC3_DEPCMD_CMDIOC				BIT_32(8)
#define _DWC3_DEPCMD_CMDACT				BIT_32(10)
#define _DWC3_DEPCMD_HIPRI_FORCERM			BIT_32(11)
#define _DWC3_DEPCMD_CMDSTATUS_MASK			GENMASK_32(15, 12)
#define _DWC3_DEPCMD_CMDSTATUS_SHIFT			12
#define _DWC3_DEPCMD_COMMANDPARAM_MASK			GENMASK_32(31, 16)
#define _DWC3_DEPCMD_COMMANDPARAM_SHIFT			16

/* _DWC3_DEV_IMOD register fields */
#define _DWC3_DEV_IMOD_DEVICE_IMODI_MASK		GENMASK_32(15, 0)
#define _DWC3_DEV_IMOD_DEVICE_IMODI_SHIFT		0
#define _DWC3_DEV_IMOD_DEVICE_IMODC_MASK		GENMASK_32(31, 16)
#define _DWC3_DEV_IMOD_DEVICE_IMODC_SHIFT		16

/*
 * USB3 BC Register Block
 */
#define _DWC3_BCFG					U(0x0)
#define _DWC3_BCEVT					U(0x8)
#define _DWC3_BCEVTEN					U(0xC)

/* _DWC3_BCFG register fields */
#define _DWC3_BCFG_CHIRP_EN				BIT_32(0)
#define _DWC3_BCFG_IDDIG_SEL				BIT_32(1)

/* _DWC3_BCEVT register fields */
#define _DWC3_BCEVT_MULTVALIDBC_MASK			GENMASK_32(4, 0)
#define _DWC3_BCEVT_MULTVALIDBC_SHIFT			0
#define _DWC3_BCEVT_MV_CHNGEVNT				BIT_32(24)

/* _DWC3_BCEVTEN register fields */
#define _DWC3_BCEVTEN_MV_CHNGEVNTENA			BIT_32(24)

/*
 * USB3 eXtensible Host Controller Capability Register Block
 */
#define _DWC3_CAPLENGTH					U(0x0)
#define _DWC3_HCSPARAMS1				U(0x4)
#define _DWC3_HCSPARAMS2				U(0x8)
#define _DWC3_HCSPARAMS3				U(0xC)
#define _DWC3_HCCPARAMS1				U(0x10)
#define _DWC3_DBOFF					U(0x14)
#define _DWC3_RTSOFF					U(0x18)
#define _DWC3_HCCPARAMS2				U(0x1C)

/* _DWC3_CAPLENGTH register fields */
#define _DWC3_CAPLENGTH_CAPLENGTH_MASK			GENMASK_32(7, 0)
#define _DWC3_CAPLENGTH_CAPLENGTH_SHIFT			0
#define _DWC3_CAPLENGTH_HCIVERSION_MASK			GENMASK_32(31, 16)
#define _DWC3_CAPLENGTH_HCIVERSION_SHIFT		16

/* _DWC3_HCSPARAMS1 register fields */
#define _DWC3_HCSPARAMS1_MAXSLOTS_MASK			GENMASK_32(7, 0)
#define _DWC3_HCSPARAMS1_MAXSLOTS_SHIFT			0
#define _DWC3_HCSPARAMS1_MAXINTRS_MASK			GENMASK_32(18, 8)
#define _DWC3_HCSPARAMS1_MAXINTRS_SHIFT			8
#define _DWC3_HCSPARAMS1_MAXPORTS_MASK			GENMASK_32(31, 24)
#define _DWC3_HCSPARAMS1_MAXPORTS_SHIFT			24

/* _DWC3_HCSPARAMS2 register fields */
#define _DWC3_HCSPARAMS2_IST_MASK			GENMASK_32(3, 0)
#define _DWC3_HCSPARAMS2_IST_SHIFT			0
#define _DWC3_HCSPARAMS2_ERSTMAX_MASK			GENMASK_32(7, 4)
#define _DWC3_HCSPARAMS2_ERSTMAX_SHIFT			4
#define _DWC3_HCSPARAMS2_MAXSCRATCHPADBUFS_HI_MASK	GENMASK_32(25, 21)
#define _DWC3_HCSPARAMS2_MAXSCRATCHPADBUFS_HI_SHIFT	21
#define _DWC3_HCSPARAMS2_SPR				BIT_32(26)
#define _DWC3_HCSPARAMS2_MAXSCRATCHPADBUFS_MASK		GENMASK_32(31, 27)
#define _DWC3_HCSPARAMS2_MAXSCRATCHPADBUFS_SHIFT	27

/* _DWC3_HCSPARAMS3 register fields */
#define _DWC3_HCSPARAMS3_U1_DEVICE_EXIT_LAT_MASK	GENMASK_32(7, 0)
#define _DWC3_HCSPARAMS3_U1_DEVICE_EXIT_LAT_SHIFT	0
#define _DWC3_HCSPARAMS3_U2_DEVICE_EXIT_LAT_MASK	GENMASK_32(31, 16)
#define _DWC3_HCSPARAMS3_U2_DEVICE_EXIT_LAT_SHIFT	16

/* _DWC3_HCCPARAMS1 register fields */
#define _DWC3_HCCPARAMS1_AC64				BIT_32(0)
#define _DWC3_HCCPARAMS1_BNC				BIT_32(1)
#define _DWC3_HCCPARAMS1_CSZ				BIT_32(2)
#define _DWC3_HCCPARAMS1_PPC				BIT_32(3)
#define _DWC3_HCCPARAMS1_PIND				BIT_32(4)
#define _DWC3_HCCPARAMS1_LHRC				BIT_32(5)
#define _DWC3_HCCPARAMS1_LTC				BIT_32(6)
#define _DWC3_HCCPARAMS1_NSS				BIT_32(7)
#define _DWC3_HCCPARAMS1_PAE				BIT_32(8)
#define _DWC3_HCCPARAMS1_SPC				BIT_32(9)
#define _DWC3_HCCPARAMS1_SEC				BIT_32(10)
#define _DWC3_HCCPARAMS1_CFC				BIT_32(11)
#define _DWC3_HCCPARAMS1_MAXPSASIZE_MASK		GENMASK_32(15, 12)
#define _DWC3_HCCPARAMS1_MAXPSASIZE_SHIFT		12
#define _DWC3_HCCPARAMS1_XECP_MASK			GENMASK_32(31, 16)
#define _DWC3_HCCPARAMS1_XECP_SHIFT			16

