DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/usb_dwc3/usb_dwc3_regs.h
/* _DWC3_DBOFF register fields */
#define _DWC3_DBOFF_DOORBELL_ARRAY_OFFSET_MASK		GENMASK_32(31, 2)
#define _DWC3_DBOFF_DOORBELL_ARRAY_OFFSET_SHIFT		2

/* _DWC3_RTSOFF register fields */
#define _DWC3_RTSOFF_RUNTIME_REG_SPACE_OFFSET_MASK	GENMASK_32(31, 5)
#define _DWC3_RTSOFF_RUNTIME_REG_SPACE_OFFSET_SHIFT	5

/* _DWC3_HCCPARAMS2 register fields */
#define _DWC3_HCCPARAMS2_U3C				BIT_32(0)
#define _DWC3_HCCPARAMS2_CMC				BIT_32(1)
#define _DWC3_HCCPARAMS2_FSC				BIT_32(2)
#define _DWC3_HCCPARAMS2_CTC				BIT_32(3)
#define _DWC3_HCCPARAMS2_LEC				BIT_32(4)
#define _DWC3_HCCPARAMS2_CIC				BIT_32(5)

/*
 * USB3 Host Cntrl Oper Regs Block
 */
#define _DWC3_USBCMD					U(0x0)
#define _DWC3_USBSTS					U(0x4)
#define _DWC3_PAGESIZE					U(0x8)
#define _DWC3_DNCTRL					U(0x14)
#define _DWC3_CRCR_LO					U(0x18)
#define _DWC3_CRCR_HI					U(0x1C)
#define _DWC3_DCBAAP_LO					U(0x30)
#define _DWC3_DCBAAP_HI					U(0x34)
#define _DWC3_CONFIG					U(0x38)

/* _DWC3_USBCMD register fields */
#define _DWC3_USBCMD_R_S				BIT_32(0)
#define _DWC3_USBCMD_HCRST				BIT_32(1)
#define _DWC3_USBCMD_INTE				BIT_32(2)
#define _DWC3_USBCMD_HSEE				BIT_32(3)
#define _DWC3_USBCMD_LHCRST				BIT_32(7)
#define _DWC3_USBCMD_CSS				BIT_32(8)
#define _DWC3_USBCMD_CRS				BIT_32(9)
#define _DWC3_USBCMD_EWE				BIT_32(10)
#define _DWC3_USBCMD_EU3S				BIT_32(11)
#define _DWC3_USBCMD_CME				BIT_32(13)

/* _DWC3_USBSTS register fields */
#define _DWC3_USBSTS_HCH				BIT_32(0)
#define _DWC3_USBSTS_HSE				BIT_32(2)
#define _DWC3_USBSTS_EINT				BIT_32(3)
#define _DWC3_USBSTS_PCD				BIT_32(4)
#define _DWC3_USBSTS_SSS				BIT_32(8)
#define _DWC3_USBSTS_RSS				BIT_32(9)
#define _DWC3_USBSTS_SRE				BIT_32(10)
#define _DWC3_USBSTS_CNR				BIT_32(11)
#define _DWC3_USBSTS_HCE				BIT_32(12)

/* _DWC3_PAGESIZE register fields */
#define _DWC3_PAGESIZE_PAGE_SIZE_MASK			GENMASK_32(15, 0)
#define _DWC3_PAGESIZE_PAGE_SIZE_SHIFT			0

/* _DWC3_DNCTRL register fields */
#define _DWC3_DNCTRL_N0_N15_MASK			GENMASK_32(15, 0)
#define _DWC3_DNCTRL_N0_N15_SHIFT			0

/* _DWC3_CRCR_LO register fields */
#define _DWC3_CRCR_LO_RCS				BIT_32(0)
#define _DWC3_CRCR_LO_CS				BIT_32(1)
#define _DWC3_CRCR_LO_CA				BIT_32(2)
#define _DWC3_CRCR_LO_CRR				BIT_32(3)
#define _DWC3_CRCR_LO_CMD_RING_PNTR_MASK		GENMASK_32(31, 6)
#define _DWC3_CRCR_LO_CMD_RING_PNTR_SHIFT		6

/* _DWC3_DCBAAP_LO register fields */
#define _DWC3_DCBAAP_LO_DEVICE_CONTEXT_BAAP_MASK	GENMASK_32(31, 6)
#define _DWC3_DCBAAP_LO_DEVICE_CONTEXT_BAAP_SHIFT	6

/* _DWC3_CONFIG register fields */
#define _DWC3_CONFIG_MAXSLOTSEN_MASK			GENMASK_32(7, 0)
#define _DWC3_CONFIG_MAXSLOTSEN_SHIFT			0
#define _DWC3_CONFIG_U3E				BIT_32(8)
#define _DWC3_CONFIG_CIE				BIT_32(9)

/*
 * USB3 Host Cntrl Port Reg Set Block
 */
#define _DWC3_PORTSC_20					U(0x0)
#define _DWC3_PORTPMSC_20				U(0x4)
#define _DWC3_PORTLI_20					U(0x8)
#define _DWC3_PORTHLPMC_20				U(0xc)
#define _DWC3_PORTSC_30					U(0x10)
#define _DWC3_PORTPMSC_30				U(0x14)
#define _DWC3_PORTLI_30					U(0x18)
#define _DWC3_PORTHLPMC_30				U(0x1c)

/* _DWC3_PORTSC_20 register fields */
#define _DWC3_PORTSC_20_CCS				BIT_32(0)
#define _DWC3_PORTSC_20_PED				BIT_32(1)
#define _DWC3_PORTSC_20_OCA				BIT_32(3)
#define _DWC3_PORTSC_20_PR				BIT_32(4)
#define _DWC3_PORTSC_20_PLS_MASK			GENMASK_32(8, 5)
#define _DWC3_PORTSC_20_PLS_SHIFT			5
#define _DWC3_PORTSC_20_PP				BIT_32(9)
#define _DWC3_PORTSC_20_PORTSPEED_MASK			GENMASK_32(13, 10)
#define _DWC3_PORTSC_20_PORTSPEED_SHIFT			10
#define _DWC3_PORTSC_20_PIC_MASK			GENMASK_32(15, 14)
#define _DWC3_PORTSC_20_PIC_SHIFT			14
#define _DWC3_PORTSC_20_LWS				BIT_32(16)
#define _DWC3_PORTSC_20_CSC				BIT_32(17)
#define _DWC3_PORTSC_20_PEC				BIT_32(18)
#define _DWC3_PORTSC_20_OCC				BIT_32(20)
#define _DWC3_PORTSC_20_PRC				BIT_32(21)
#define _DWC3_PORTSC_20_PLC				BIT_32(22)
#define _DWC3_PORTSC_20_CAS				BIT_32(24)
#define _DWC3_PORTSC_20_WCE				BIT_32(25)
#define _DWC3_PORTSC_20_WDE				BIT_32(26)
#define _DWC3_PORTSC_20_WOE				BIT_32(27)
#define _DWC3_PORTSC_20_DR				BIT_32(30)

/* _DWC3_PORTPMSC_20 register fields */
#define _DWC3_PORTPMSC_20_L1S_MASK			GENMASK_32(2, 0)
#define _DWC3_PORTPMSC_20_L1S_SHIFT			0
#define _DWC3_PORTPMSC_20_RWE				BIT_32(3)
#define _DWC3_PORTPMSC_20_HIRD_MASK			GENMASK_32(7, 4)
#define _DWC3_PORTPMSC_20_HIRD_SHIFT			4
#define _DWC3_PORTPMSC_20_L1DSLOT_MASK			GENMASK_32(15, 8)
#define _DWC3_PORTPMSC_20_L1DSLOT_SHIFT			8
#define _DWC3_PORTPMSC_20_HLE				BIT_32(16)
#define _DWC3_PORTPMSC_20_PRTTSTCTRL_MASK		GENMASK_32(31, 28)
#define _DWC3_PORTPMSC_20_PRTTSTCTRL_SHIFT		28

/* _DWC3_PORTHLPMC_20 register fields */
#define _DWC3_PORTHLPMC_20_HIRDM_MASK			GENMASK_32(1, 0)
#define _DWC3_PORTHLPMC_20_HIRDM_SHIFT			0
#define _DWC3_PORTHLPMC_20_L1_TIMEOUT_MASK		GENMASK_32(9, 2)
#define _DWC3_PORTHLPMC_20_L1_TIMEOUT_SHIFT		2
#define _DWC3_PORTHLPMC_20_HIRDD_MASK			GENMASK_32(13, 10)
#define _DWC3_PORTHLPMC_20_HIRDD_SHIFT			10

/* _DWC3_PORTSC_30 register fields */
#define _DWC3_PORTSC_30_CCS				BIT_32(0)
#define _DWC3_PORTSC_30_PED				BIT_32(1)
#define _DWC3_PORTSC_30_OCA				BIT_32(3)
#define _DWC3_PORTSC_30_PR				BIT_32(4)
#define _DWC3_PORTSC_30_PLS_MASK			GENMASK_32(8, 5)
#define _DWC3_PORTSC_30_PLS_SHIFT			5
#define _DWC3_PORTSC_30_PP				BIT_32(9)
#define _DWC3_PORTSC_30_PORTSPEED_MASK			GENMASK_32(13, 10)
#define _DWC3_PORTSC_30_PORTSPEED_SHIFT			10
#define _DWC3_PORTSC_30_PIC_MASK			GENMASK_32(15, 14)
#define _DWC3_PORTSC_30_PIC_SHIFT			14
#define _DWC3_PORTSC_30_LWS				BIT_32(16)
#define _DWC3_PORTSC_30_CSC				BIT_32(17)
#define _DWC3_PORTSC_30_PEC				BIT_32(18)
#define _DWC3_PORTSC_30_WRC				BIT_32(19)
#define _DWC3_PORTSC_30_OCC				BIT_32(20)
#define _DWC3_PORTSC_30_PRC				BIT_32(21)
#define _DWC3_PORTSC_30_PLC				BIT_32(22)
#define _DWC3_PORTSC_30_CEC				BIT_32(23)
#define _DWC3_PORTSC_30_CAS				BIT_32(24)
#define _DWC3_PORTSC_30_WCE				BIT_32(25)
#define _DWC3_PORTSC_30_WDE				BIT_32(26)
#define _DWC3_PORTSC_30_WOE				BIT_32(27)
#define _DWC3_PORTSC_30_DR				BIT_32(30)
#define _DWC3_PORTSC_30_WPR				BIT_32(31)

/* _DWC3_PORTPMSC_30 register fields */
#define _DWC3_PORTPMSC_30_U1_TIMEOUT_MASK		GENMASK_32(7, 0)
#define _DWC3_PORTPMSC_30_U1_TIMEOUT_SHIFT		0
#define _DWC3_PORTPMSC_30_U2_TIMEOUT_MASK		GENMASK_32(15, 8)
#define _DWC3_PORTPMSC_30_U2_TIMEOUT_SHIFT		8
#define _DWC3_PORTPMSC_30_FLA				BIT_32(16)

/* _DWC3_PORTLI_30 register fields */
#define _DWC3_PORTLI_30_LINK_ERROR_COUNT_MASK		GENMASK_32(15, 0)
#define _DWC3_PORTLI_30_LINK_ERROR_COUNT_SHIFT		0

