DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/drivers/st/usb_dwc3/usb_dwc3_regs.h
/*
 * USB3 Host Cntrl Runtime Regs Block
 */
#define _DWC3_MFINDEX					U(0x0)

/* _DWC3_MFINDEX register fields */
#define _DWC3_MFINDEX_MICROFRAME_INDEX_MASK		GENMASK_32(13, 0)
#define _DWC3_MFINDEX_MICROFRAME_INDEX_SHIFT		0

/*
 * USB3 Interrupter Regs Block
 */
#define _DWC3_IMAN					U(0x0)
#define _DWC3_IMOD					U(0x4)
#define _DWC3_ERSTSZ					U(0x8)
#define _DWC3_ERSTBA_LO					U(0x10)
#define _DWC3_ERSTBA_HI					U(0x14)
#define _DWC3_ERDP_LO					U(0x18)
#define _DWC3_ERDP_HI					U(0x1c)

/* _DWC3_IMAN register fields */
#define _DWC3_IMAN_IP					BIT_32(0)
#define _DWC3_IMAN_IE					BIT_32(1)

/* _DWC3_IMOD register fields */
#define _DWC3_IMOD_IMODI_MASK				GENMASK_32(15, 0)
#define _DWC3_IMOD_IMODI_SHIFT				0
#define _DWC3_IMOD_IMODC_MASK				GENMASK_32(31, 16)
#define _DWC3_IMOD_IMODC_SHIFT				16

/* _DWC3_ERSTSZ register fields */
#define _DWC3_ERSTSZ_ERS_TABLE_SIZE_MASK		GENMASK_32(15, 0)
#define _DWC3_ERSTSZ_ERS_TABLE_SIZE_SHIFT		0

/* _DWC3_ERSTBA_LO register fields */
#define _DWC3_ERSTBA_LO_ERS_TABLE_BAR_MASK		GENMASK_32(31, 6)
#define _DWC3_ERSTBA_LO_ERS_TABLE_BAR_SHIFT		6

/* _DWC3_ERDP_LO register fields */
#define _DWC3_ERDP_LO_DESI_MASK				GENMASK_32(2, 0)
#define _DWC3_ERDP_LO_DESI_SHIFT			0
#define _DWC3_ERDP_LO_EHB				BIT_32(3)
#define _DWC3_ERDP_LO_ERD_PNTR_MASK			GENMASK_32(31, 4)
#define _DWC3_ERDP_LO_ERD_PNTR_SHIFT			4

/*
 * USB3 Doorbell Reg Block
 */
#define _DWC3_DB					U(0x0)

/* _DWC3_DB register fields */
#define _DWC3_DB_DB_TARGET_MASK				GENMASK_32(7, 0)
#define _DWC3_DB_DB_TARGET_SHIFT			0
#define _DWC3_DB_DB_STREAM_ID_MASK			GENMASK_32(31, 16)
#define _DWC3_DB_DB_STREAM_ID_SHIFT			16

/*
 * USB3 internal RAM0 Register Block

 * For a description of this standard USB register field, see the eXtensible Host Controller
 * Interface for Universal Serial Bus (USB) Specification 3.0.

 */

/*
 * USB3 internal RAM1 Register Block

 * For a description of this standard USB register field, see the eXtensible Host Controller
 * Interface for Universal Serial Bus (USB) Specification 3.0.

 */

/*
 * USB3 internal RAM2 Register Block
 */

/*
 * USB3 HC Extended Capability Register Block
 */
#define _DWC3_USBLEGSUP					U(0x0)
#define _DWC3_USBLEGCTLSTS				U(0x4)

/* _DWC3_USBLEGSUP register fields */
#define _DWC3_USBLEGSUP_CAPABILITY_ID_MASK		GENMASK_32(7, 0)
#define _DWC3_USBLEGSUP_CAPABILITY_ID_SHIFT		0
#define _DWC3_USBLEGSUP_NEXT_CAPABILITY_POINTER_MASK	GENMASK_32(15, 8)
#define _DWC3_USBLEGSUP_NEXT_CAPABILITY_POINTER_SHIFT	8
#define _DWC3_USBLEGSUP_HC_BIOS_OWNED			BIT_32(16)
#define _DWC3_USBLEGSUP_HC_OS_OWNED			BIT_32(24)

/* _DWC3_USBLEGCTLSTS register fields */
#define _DWC3_USBLEGCTLSTS_USB_SMI_ENABLE		BIT_32(0)
#define _DWC3_USBLEGCTLSTS_SMI_ON_HOST_E		BIT_32(4)
#define _DWC3_USBLEGCTLSTS_SMI_ON_OS_E			BIT_32(13)
#define _DWC3_USBLEGCTLSTS_SMI_ON_PCI_E			BIT_32(14)
#define _DWC3_USBLEGCTLSTS_SMI_ON_BAR_E			BIT_32(15)
#define _DWC3_USBLEGCTLSTS_SMI_ON_EVENT			BIT_32(16)
#define _DWC3_USBLEGCTLSTS_SMI_ON_HOST			BIT_32(20)
#define _DWC3_USBLEGCTLSTS_SMI_ON_OS			BIT_32(29)
#define _DWC3_USBLEGCTLSTS_SMI_ON_PCI			BIT_32(30)
#define _DWC3_USBLEGCTLSTS_SMI_ON_BAR			BIT_32(31)

/*
 * USB3 xHCI Supported Protocol Capability (USB 2.0) Block
 */
#define _DWC3_SUPTPRT2_DW0				U(0x0)
#define _DWC3_SUPTPRT2_DW1				U(0x4)
#define _DWC3_SUPTPRT2_DW2				U(0x8)
#define _DWC3_SUPTPRT2_DW3				U(0xC)

/* _DWC3_SUPTPRT2_DW0 register fields */
#define _DWC3_SUPTPRT2_DW0_CAPABILITY_ID_MASK		GENMASK_32(7, 0)
#define _DWC3_SUPTPRT2_DW0_CAPABILITY_ID_SHIFT		0
#define _DWC3_SUPTPRT2_DW0_NEXT_CAPABILITY_POINTER_MASK	GENMASK_32(15, 8)
#define _DWC3_SUPTPRT2_DW0_NEXT_CAPABILITY_POINTER_SHIFT	8
#define _DWC3_SUPTPRT2_DW0_MINOR_REVISION_MASK		GENMASK_32(23, 16)
#define _DWC3_SUPTPRT2_DW0_MINOR_REVISION_SHIFT		16
#define _DWC3_SUPTPRT2_DW0_MAJOR_REVISION_MASK		GENMASK_32(31, 24)
#define _DWC3_SUPTPRT2_DW0_MAJOR_REVISION_SHIFT		24

/* _DWC3_SUPTPRT2_DW2 register fields */
#define _DWC3_SUPTPRT2_DW2_COMPATIBLE_PORT_OFFSET_MASK	GENMASK_32(7, 0)
#define _DWC3_SUPTPRT2_DW2_COMPATIBLE_PORT_OFFSET_SHIFT	0
#define _DWC3_SUPTPRT2_DW2_COMPATIBLE_PORT_COUNT_MASK	GENMASK_32(15, 8)
#define _DWC3_SUPTPRT2_DW2_COMPATIBLE_PORT_COUNT_SHIFT	8
#define _DWC3_SUPTPRT2_DW2_HSO				BIT_32(17)
#define _DWC3_SUPTPRT2_DW2_IHI				BIT_32(18)
#define _DWC3_SUPTPRT2_DW2_HLC				BIT_32(19)
#define _DWC3_SUPTPRT2_DW2_BLC				BIT_32(20)
#define _DWC3_SUPTPRT2_DW2_MHD_MASK			GENMASK_32(27, 25)
#define _DWC3_SUPTPRT2_DW2_MHD_SHIFT			25
#define _DWC3_SUPTPRT2_DW2_PSIC_MASK			GENMASK_32(31, 28)
#define _DWC3_SUPTPRT2_DW2_PSIC_SHIFT			28

/* _DWC3_SUPTPRT2_DW3 register fields */
#define _DWC3_SUPTPRT2_DW3_PROTCL_SLT_TY_MASK		GENMASK_32(4, 0)
#define _DWC3_SUPTPRT2_DW3_PROTCL_SLT_TY_SHIFT		0

/*
 * USB3 xHCI Supported Protocol Capability (USB 3.0) Block
 */
#define _DWC3_SUPTPRT3_DW0				U(0x0)
#define _DWC3_SUPTPRT3_DW1				U(0x4)
#define _DWC3_SUPTPRT3_DW2				U(0x8)
#define _DWC3_SUPTPRT3_DW3				U(0xC)

/* _DWC3_SUPTPRT3_DW0 register fields */
#define _DWC3_SUPTPRT3_DW0_CAPABILITY_ID_MASK		GENMASK_32(7, 0)
#define _DWC3_SUPTPRT3_DW0_CAPABILITY_ID_SHIFT		0
#define _DWC3_SUPTPRT3_DW0_NEXT_CAPABILITY_POINTER_MASK	GENMASK_32(15, 8)
#define _DWC3_SUPTPRT3_DW0_NEXT_CAPABILITY_POINTER_SHIFT	8
#define _DWC3_SUPTPRT3_DW0_MINOR_REVISION_MASK		GENMASK_32(23, 16)
#define _DWC3_SUPTPRT3_DW0_MINOR_REVISION_SHIFT		16
#define _DWC3_SUPTPRT3_DW0_MAJOR_REVISION_MASK		GENMASK_32(31, 24)
#define _DWC3_SUPTPRT3_DW0_MAJOR_REVISION_SHIFT		24

/* _DWC3_SUPTPRT3_DW2 register fields */
#define _DWC3_SUPTPRT3_DW2_COMPATIBLE_PORT_OFFSET_MASK	GENMASK_32(7, 0)
#define _DWC3_SUPTPRT3_DW2_COMPATIBLE_PORT_OFFSET_SHIFT	0
#define _DWC3_SUPTPRT3_DW2_COMPATIBLE_PORT_COUNT_MASK	GENMASK_32(15, 8)
#define _DWC3_SUPTPRT3_DW2_COMPATIBLE_PORT_COUNT_SHIFT	8
#define _DWC3_SUPTPRT3_DW2_MHD_MASK			GENMASK_32(27, 25)
#define _DWC3_SUPTPRT3_DW2_MHD_SHIFT			25
#define _DWC3_SUPTPRT3_DW2_PSIC_MASK			GENMASK_32(31, 28)
#define _DWC3_SUPTPRT3_DW2_PSIC_SHIFT			28

/* _DWC3_SUPTPRT3_DW3 register fields */
#define _DWC3_SUPTPRT3_DW3_PROTCL_SLT_TY_MASK		GENMASK_32(4, 0)
#define _DWC3_SUPTPRT3_DW3_PROTCL_SLT_TY_SHIFT		0

#endif /* __USB_DWC3_REGS_H */
